axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"

#include "interfaces/http/Dnsd.h"
#include "interfaces/http/Http.h"

// generated web content
#include "generated/index_html.h"
#include "generated/jquery_min_js.h"
#include "generated/jquery_mobile_js.h"
#include "generated/jquery_mobile_css.h"
#include "generated/jquery_simple_websocket.h"
#include "generated/jq_clock.h"
#include "generated/ajax_loader.h"
#include "generated/loco_32x32.h"

using esp32cs::http::Httpd;
using esp32cs::http::HttpMethod;
using esp32cs::http::HttpRequest;
using esp32cs::http::HttpStatusCode;
using esp32cs::http::AbstractHttpResponse;
using esp32cs::http::StringResponse;
using esp32cs::http::WebSocketFlow;
using esp32cs::http::MIME_TYPE_TEXT_HTML;
using esp32cs::http::MIME_TYPE_TEXT_CSS;
using esp32cs::http::MIME_TYPE_IMAGE_PNG;
using esp32cs::http::MIME_TYPE_IMAGE_GIF;
using esp32cs::http::MIME_TYPE_TEXT_JAVASCRIPT;
using esp32cs::http::MIME_TYPE_APPLICATION_JSON;
using esp32cs::http::HTTP_ENCODING_GZIP;
using esp32cs::http::WebSocketEvent;

// Captive Portal landing page
static constexpr const char * const CAPTIVE_PORTAL_HTML =
  "<html>"
  "<title>ESP32 Command Station v%s</title>"
  "<meta http-equiv=\"refresh\" content=\"30;url='/captiveauth'\" /> "
  "<body>"
  "<h1>Welcome to the ESP32 Command Station</h1>"
  "<h2>Open your browser and navigate to any website and it will open the "
  "ESP32 Command Station</h2>"
  "<p>Click <a href=\"/captiveauth\">here</a> to close this portal "
  "page if it does not automatically close.</p>" 
  "</body>"
  "</html>";

AsyncWebServer webServer(80);
AsyncWebSocket webSocket("/ws");
unique_ptr<Httpd> httpd;

static constexpr const char * const APPLICATION_JSON_TYPE = "application/json";

enum HTTP_STATUS_CODES
{
  STATUS_OK = 200
, STATUS_NO_CONTENT = 204
, STATUS_NOT_MODIFIED = 304
, STATUS_BAD_REQUEST = 400
, STATUS_NOT_FOUND = 404
, STATUS_NOT_ALLOWED = 405
, STATUS_NOT_ACCEPTABLE = 406
, STATUS_CONFLICT = 409
, STATUS_PRECONDITION_FAILED = 412
, STATUS_SERVER_ERROR = 500
};

Atomic webSocketAtomic;
vector<unique_ptr<WebSocketClient>> webSocketClients;

class WebSocketExecutable : public Executable
{
public:
  WebSocketExecutable(AsyncWebSocketClient *client, AwsEventType type
                    , uint8_t *data, size_t len)
  : clientId_(client->id()), clientIp_(client->remoteIP()), type_(type)
  {
    if (data && len)
    {
      for(size_t index = 0; index < len; index++)
      {
        data_.push_back(data[index]);
      }
    }
  }

  void run() override
  {
    AtomicHolder h(&webSocketAtomic);
    if (type_ == WS_EVT_CONNECT)
    {
      webSocketClients.push_back(esp32cs::make_unique<WebSocketClient>(clientId_, clientIp_));
      Singleton<InfoScreen>::instance()->replaceLine(
        INFO_SCREEN_CLIENTS_LINE, "TCP Conn: %02d"
      , webSocketClients.size() + jmriClients.size());
    }
    else if (type_ == WS_EVT_DISCONNECT)
    {
      auto const &elem = std::find_if(webSocketClients.begin()
                                    , webSocketClients.end()
      , [&](unique_ptr<WebSocketClient> & clientNode) -> bool
        {
          return clientNode->getID() == clientId_;
        }
      );
      if (elem != webSocketClients.end())
      {
        webSocketClients.erase(elem);
      }
      Singleton<InfoScreen>::instance()->replaceLine(
        INFO_SCREEN_CLIENTS_LINE, "TCP Conn: %02d",
        webSocketClients.size() + jmriClients.size());
    }
    else if (type_ == WS_EVT_DATA)
    {
      auto ent = std::find_if(webSocketClients.begin(), webSocketClients.end()
      , [&](unique_ptr<WebSocketClient> & clientNode) -> bool
        {
          return (clientNode->getID() == clientId_);
        }
      );
      if (ent != webSocketClients.end())
      {
        auto res = (*ent)->feed(data_.data(), data_.size());
        if (res.length())
        {
          webSocket.text(clientId_, res.c_str());
        }
      }
    }
    delete this;
  }
private:
  int clientId_;
  uint32_t clientIp_;
  AwsEventType type_;
  std::vector<uint8_t> data_;
};

void handleWsEvent(AsyncWebSocket * server,
                   AsyncWebSocketClient * client,
                   AwsEventType type,
                   void * arg,
                   uint8_t *data,
                   size_t len)
{
  extern unique_ptr<OpenMRN> openmrn;
  openmrn->stack()->executor()->add(
    new WebSocketExecutable(client, type, data, len));
}

ESP32CSWebServer::ESP32CSWebServer(MDNS *mdns) : mdns_(mdns)
{
}

using namespace std::placeholders;

#define BUILTIN_URI(uri) \
  webServer.on(uri \
             , HTTP_GET \
             , std::bind(&ESP32CSWebServer::streamResource, this, _1));

#define GET_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET \
             , std::bind(&ESP32CSWebServer::method, this, _1));

#define GET_POST_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST \
             , std::bind(&ESP32CSWebServer::method, this, _1));

#define GET_PUT_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_PUT \
             , std::bind(&ESP32CSWebServer::method, this, _1));

#define GET_POST_DELETE_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST | HTTP_DELETE \
             , std::bind(&ESP32CSWebServer::method, this, _1));

#define GET_POST_PUT_DELETE_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE \
             , std::bind(&ESP32CSWebServer::method, this, _1));

#define POST_UPLOAD_URI(uri, method, callback) \
  webServer.on(uri \
             , HTTP_POST \
             , std::bind(&ESP32CSWebServer::method, this, _1) \
             , callback);

#define SEND_GENERIC_RESPONSE(request, code) \
  request->send(code); \
  return;

#define SEND_TEXT_RESPONSE(request, code, text) \
  request->send(code, "text/plain", text);

#define SEND_HTML_RESPONSE(request, code, text) \
  request->send(code, "text/html", text);

#define SEND_JSON_RESPONSE(request, response) \
  request->send(STATUS_OK, APPLICATION_JSON_TYPE, response.c_str()); \
  return; \

#define SEND_JSON_IF_OBJECT(request, object) \
  if (object) \
  { \
    SEND_JSON_RESPONSE(request, object->toJson()) \
  } \
  else \
  { \
    SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND) \
  }

#define SEND_JSON_IF_OBJECT_ARG(request, object, arg) \
  if (object) \
  { \
    SEND_JSON_RESPONSE(request, object->toJson(arg)) \
  } \
  else \
  { \
    SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND) \
  }

esp_ota_handle_t otaHandle;
void otaUploadCallback(AsyncWebServerRequest *request
                     , const String& filename
                     , size_t index
                     , uint8_t *data
                     , size_t len
                     , bool final)
{
  esp_err_t res = ESP_OK;
  if (!index)
  {
    request->_tempObject = (void *)esp_ota_get_next_update_partition(NULL);
    res = esp_ota_begin((esp_partition_t *)request->_tempObject
                      , OTA_SIZE_UNKNOWN
                      , &otaHandle);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    LOG(INFO, "[WebSrv] OTA Update starting...");
    trackSignal->disable_ops_output();
    trackSignal->disable_prog_output();
    Singleton<OTAMonitorFlow>::instance()->report_start();
  }
  res = esp_ota_write(otaHandle, data, len);
  if (res != ESP_OK)
  {
    goto ota_failure;
  }
  Singleton<OTAMonitorFlow>::instance()->report_progress(len);
  if (final)
  {
    res = esp_ota_end(otaHandle);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    LOG(INFO, "[WebSrv] OTA binary received, setting boot partition");
    res = esp_ota_set_boot_partition((esp_partition_t *)request->_tempObject);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    request->_tempObject = nullptr;
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    Singleton<OTAMonitorFlow>::instance()->report_success();
  }
  return;

ota_failure:
  request->_tempObject = nullptr;
  LOG_ERROR("[WebSrv] OTA Update failure: %s (%d)", esp_err_to_name(res), res);
  SEND_TEXT_RESPONSE(request, STATUS_BAD_REQUEST, esp_err_to_name(res))
  Singleton<OTAMonitorFlow>::instance()->report_failure(res);
}

void ESP32CSWebServer::init()
{
  httpd.reset(new Httpd(mdns_));
  httpd->redirect_uri("/", "/index.html");
  // if the soft AP interface is enabled, setup the captive portal
  if (configStore->isAPEnabled())
  {
    httpd->captive_portal(StringPrintf(CAPTIVE_PORTAL_HTML, PROJECT_VER));
  }
  httpd->static_uri("/index.html", indexHtmlGz, indexHtmlGz_size
                  , MIME_TYPE_TEXT_HTML, HTTP_ENCODING_GZIP);
  httpd->static_uri("/loco-32x32.png", loco32x32, loco32x32_size
                  , MIME_TYPE_IMAGE_PNG);
  httpd->static_uri("/jquery.min.js", jqueryJsGz, jqueryJsGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.js", jqueryMobileJsGz
                  , jqueryMobileJsGz_size, MIME_TYPE_TEXT_JAVASCRIPT
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.css", jqueryMobileCssGz
                  , jqueryMobileCssGz_size, MIME_TYPE_TEXT_CSS
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.simple.websocket.min.js"
                  , jquerySimpleWebSocketGz, jquerySimpleWebSocketGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jqClock-lite.min.js", jqClockGz, jqClockGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/images/ajax-loader.gif", ajaxLoader, ajaxLoader_size
                  , MIME_TYPE_IMAGE_GIF);
  httpd->uri("/features", [&](HttpRequest *req)
  {
    return new StringResponse(configStore->getCSFeatures()
                            , MIME_TYPE_APPLICATION_JSON);
  });
  httpd->uri("/power", HttpMethod::GET | HttpMethod::PUT
           , std::bind(&ESP32CSWebServer::handlePower, this
                     , std::placeholders::_1));
  httpd->uri("/update", HttpMethod::POST, nullptr
    , [&](HttpRequest *req, const std::string &filename, size_t size
        , const uint8_t * data, size_t length, size_t offset, bool final
        , bool *abort)
  {
    if (final)
    {
      req->set_status(HttpStatusCode::STATUS_OK);
    }
    return nullptr;
  });
  httpd->websocket_uri("/ws"
    , [](WebSocketFlow *client, WebSocketEvent event, const uint8_t *data
       , size_t data_len)
  {
    AtomicHolder h(&webSocketAtomic);
    if (event == WebSocketEvent::WS_EVENT_CONNECT)
    {
      webSocketClients.push_back(
        esp32cs::make_unique<WebSocketClient>(client->get_id()
                                            , client->get_remote_ip()));
      Singleton<InfoScreen>::instance()->replaceLine(
        INFO_SCREEN_CLIENTS_LINE, "TCP Conn: %02d"
      , webSocketClients.size() + jmriClients.size());
    }
    else if (event == WebSocketEvent::WS_EVENT_DISCONNECT)
    {
      webSocketClients.erase(std::remove_if(webSocketClients.begin()
                                          , webSocketClients.end()
      , [client](unique_ptr<WebSocketClient> &inst) -> bool
        {
          return inst->getID() == client->get_id();
        }));
      Singleton<InfoScreen>::instance()->replaceLine(
        INFO_SCREEN_CLIENTS_LINE, "TCP Conn: %02d",
        webSocketClients.size() + jmriClients.size());
    }
    else if (event == WebSocketEvent::WS_EVENT_TEXT)
    {
      auto ent = std::find_if(webSocketClients.begin(), webSocketClients.end()
      , [client](unique_ptr<WebSocketClient> &inst) -> bool
        {
          return inst->getID() == client->get_id();
        }
      );
      if (ent != webSocketClients.end())
      {
        // TODO: remove cast that drops const
        auto res = (*ent)->feed((uint8_t *)data, data_len);
        if (res.length())
        {
          client->send_text(res);
        }
      }
    }
  });
}

void ESP32CSWebServer::begin()
{
}

void ESP32CSWebServer::handleProgrammer(AsyncWebServerRequest *request)
{
  if (request->method() == HTTP_GET)
  {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
    else if(request->hasArg(JSON_IDENTIFY_NODE))
    {
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      uint16_t decoderAddress = 0;
      if (decoderConfig > 0)
      {
        string response = "{";
        if (bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE))
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                   , JSON_VALUE_LONG_ADDRESS);
          }
          else
          {
            LOG(WARNING, "Failed to read address MSB/LSB");
            SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
          }
        }
        else
        {
          if (bitRead(decoderConfig, DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS))
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_LONG_ADDRESS);

