axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void ESP32CSWebServer::handleOTA(AsyncWebServerRequest *request)
{
  SEND_TEXT_RESPONSE(request, STATUS_OK, "OTA Upload Complete")
}

void ESP32CSWebServer::handleFeatures(AsyncWebServerRequest *request)
{
  SEND_JSON_RESPONSE(request, configStore->getCSFeatures())
}

#define IP_TO_STR(request) \
  ipv4_to_string(ntohl(request->client()->getRemoteAddress())).c_str()

#define STREAM_RESOURCE_NO_REDIRECT(request, uri, mimeType, totalSize, resource) \
  if (request->url() == uri) \
  { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", IP_TO_STR(request), uri, totalSize, mimeType); \
    auto response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize, nullptr); \
    if(!string(mimeType).compare(0, 5, "text/")) \
    { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
    response->addHeader("Last-Modified", htmlBuildTime); \
    SEND_GENERIC_RESPONSE(request, response) \
  }

#define STREAM_RESOURCE(request, uri, fallback, mimeType, totalSize, resource) \
  if (request->url() == uri && configStore->isAPEnabled() && softAPAddress_.compare(request->host().c_str()) == 0) \
  { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", IP_TO_STR(request), uri, totalSize, mimeType); \
    auto response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize, nullptr); \
    if(!string(mimeType).compare(0, 5, "text/")) \
    { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
    response->addHeader("Last-Modified", htmlBuildTime); \
    SEND_GENERIC_RESPONSE(request, response) \
  } \
  else if (request->url() == uri) \
  { \
    LOG(INFO, "[WebSrv %s] Requested %s => CDN %s", IP_TO_STR(request), uri, fallback); \
    request->redirect(fallback); \
  }

void ESP32CSWebServer::streamResource(AsyncWebServerRequest *request)
{
  const char * htmlBuildTime = __DATE__ " " __TIME__;
  if (request->header("If-Modified-Since").equals(htmlBuildTime))
  {
    SEND_GENERIC_RESPONSE(request, STATUS_NOT_MODIFIED)
  }
  else
  {
    STREAM_RESOURCE_NO_REDIRECT(request, "/index.html", "text/html"
                              , indexHtmlGz_size, indexHtmlGz)
    STREAM_RESOURCE_NO_REDIRECT(request, "/loco-32x32.png", "image/png"
                              , loco32x32_size, loco32x32)
    STREAM_RESOURCE(request, "/jquery.min.js"
                  , "https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js"
                  , "text/javascript", jqueryJsGz_size, jqueryJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.js"
                  , "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.js"
                  , "text/javascript", jqueryMobileJsGz_size, jqueryMobileJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.css"
                  , "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.css"
                  , "text/css", jqueryMobileCssGz_size, jqueryMobileCssGz)
    STREAM_RESOURCE(request, "/jquery.simple.websocket.min.js"
                  , "https://cdn.rawgit.com/jbloemendal/jquery-simple-websocket/master/dist/jquery.simple.websocket.min.js"
                  , "text/javascript", jquerySimpleWebSocketGz_size, jquerySimpleWebSocketGz)
    STREAM_RESOURCE(request, "/jqClock-lite.min.js"
                  , "https://cdn.rawgit.com/JohnRDOrazio/jQuery-Clock-Plugin/master/jqClock-lite.min.js"
                  , "text/javascript", jqClockGz_size, jqClockGz)
    STREAM_RESOURCE(request, "/images/ajax-loader.gif"
                  , "https://code.jquery.com/mobile/1.5.0-rc1/images/ajax-loader.gif"
                  , "image/gif", ajaxLoader_size, ajaxLoader)

    SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND)
  }
}

// Known captive portal checks to respond with http 200 and redirect link
static string portalCheckRedirect[] =
{
  "/generate_204",                  // Android
  "/gen_204",                       // Android 9.0
  "/mobile/status.php",             // Android 8.0 (Samsung s9+)
  "/ncsi.txt",                      // Windows
  "/success.txt",                   // OSX / FireFox
  "/hotspot-detect.html",           // iOS 8/9
  "/hotspotdetect.html",            // iOS 8/9
  "/library/test/success.html"      // iOS 8/9
  "/kindle-wifi/wifiredirect.html"  // Kindle
  "/kindle-wifi/wifistub.html"      // Kindle
};

// iOS success page content
static constexpr const char * const CAPTIVE_SUCCESS_200_HTML = 
  "<HTML><HEAD><TITLE>Success</TITLE></HEAD><BODY>Success</BODY></HTML>";
// Windows success page content
static constexpr const char * const CAPTIVE_SUCCESS_200_NCSI_TXT = 
  "Microsoft NCSI";
// Generic success.txt page content
static constexpr const char * const CAPTIVE_SUCCESS_200_SUCCESS_TXT = 
  "success";

void ESP32CSWebServer::notFoundHandler(AsyncWebServerRequest *request)
{
  if (configStore->isAPEnabled())
  {
    uint32_t clientIP = static_cast<uint32_t>(request->client()->remoteIP());
    for (auto uri : portalCheckRedirect)
    {
      if (!uri.compare(request->url().c_str()))
      {
        if (std::find(captiveIPs_.begin(), captiveIPs_.end()
                    , clientIP) != captiveIPs_.end())
        {
          // we have seen this IP previously and they have clicked through
          // to the index.html already, send back a 200 or 204 response.
          if (request->url().endsWith("_204") ||
              request->url().endsWith("status.php"))
          {
            // no payload required for this one, just the status code.
            SEND_GENERIC_RESPONSE(request, STATUS_NO_CONTENT)
          }
          else if (request->url().endsWith("ncsi.txt"))
          {
            SEND_TEXT_RESPONSE(request, STATUS_OK, CAPTIVE_SUCCESS_200_NCSI_TXT)
          }
          else if (request->url().endsWith("success.txt"))
          {
            SEND_TEXT_RESPONSE(request, STATUS_OK, CAPTIVE_SUCCESS_200_SUCCESS_TXT)
          }
          else
          {
            SEND_TEXT_RESPONSE(request, STATUS_OK, CAPTIVE_SUCCESS_200_HTML)
          }
        }
        else
        {
          LOG(INFO, "[WebSrv %s] Requested %s%s: Redirecting to captive portal"
            , IP_TO_STR(request), request->host().c_str()
            , request->url().c_str());
          SEND_HTML_RESPONSE(request, STATUS_OK,
                        StringPrintf(CAPTIVE_PORTAL_HTML
                                   , PROJECT_VER).c_str())
        }
        return;
      }
    }
    if (request->url().equals("/captiveauth"))
    {
      // check if we have seen this client IP before (for captive portal check)
      if (std::find(captiveIPs_.begin(), captiveIPs_.end()
                  , clientIP) == captiveIPs_.end())
      {
        captiveIPs_.push_back(clientIP);
      }
      SEND_GENERIC_RESPONSE(request, STATUS_OK)
    }
  }
  if (request->url().equals("/"))
  {
    string interfaceIP(request->client()->localIP().toString().c_str());
    request->redirect(StringPrintf("http://%s/index.html", interfaceIP.c_str()).c_str());
    return;
  }
  LOG(INFO, "[WebSrv %s] 404: %s%s", IP_TO_STR(request)
    , request->host().c_str(), request->url().c_str());
  SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND)
}
